Revit 2027 API
ExternalServices.BuiltInExternalServices.GeometryAugmentationService Property
 Autodesk Internal: The service where GeometryAugmentationServers can be registered.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId GeometryAugmentationService { get; }
Public Shared ReadOnly Property GeometryAugmentationService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ GeometryAugmentationService {
	ExternalServiceId^ get ();
}
static member GeometryAugmentationService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace